alrenyang/stm32h743zit6_TRI/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdint.h>
#include <string.h>
#include <stdbool.h>
#include "stm32h743xx.h"
#include "stm32h7xx_hal_cortex.h"
#include "tcp_ip.h"
#include "lwip/tcp.h"
#include "lwip/pbuf.h"
#include "lcd.h"
#include "../Middlewares/lvgl/lvgl.h"
#include "lv_port_disp.h"
#include "lv_port_indev.h"
#include "com_define.h"
#include "sdram.h"
#include "widgets.h"
#include "hw.h"
#include <stdio.h>
#include <sys/types.h>
#include "user_def.h"
#include "ax_uart2.h"
#include "packet_task.h"
#include "ax_mcu_if.h"
#include "ax_eeprom.h"
#include "reg_addr.h"
#include "ax_eeprom_task.h"
#include "com_widget.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
uint16_t *FrameBuffer = (uint16_t *)LCD_FB_ADDR;
extern struct netif gnetif;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c4;

LTDC_HandleTypeDef hltdc;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

SDRAM_HandleTypeDef hsdram1;

osThreadId MainTaskHandle;
/* USER CODE BEGIN PV */

static void MX_NVIC_Init(void);
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart);
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C4_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_DMA2D_Init(void);
static void MX_LTDC_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
uint8_t gete_way_ip[4] = {192,168,0,1};	//user set up
uint8_t user_ip[4] = {192,168,0,50};
uint16_t Port_No = 5001;
uint32_t g_rs232_baud = 115200;

volatile bool btcp_connect = false;

#define U2_RX_BUF_SZ 256  //uart 버퍼 크기
volatile uint8_t u2_rx_buf[U2_RX_BUF_SZ];
volatile uint16_t u2_rx_w = 0;
uint8_t rx2_data = 0;

uint8_t g_tcp_recv_buffer[TCP_RECV_BUF_SIZE];	//TCP로 데이터를 받는다...
volatile uint32_t g_tcp_recv_len = 0;
volatile bool g_tcp_new_data_flag = false;
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config(); 

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FMC_Init();
  MX_I2C4_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_DMA2D_Init();
  MX_LTDC_Init();
  /* USER CODE BEGIN 2 */
  MX_NVIC_Init();

  //LAN8742 RESET PIN
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_SET);
  HAL_Delay(500);

  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);	//DISP Control
  HAL_Delay(250); // Datasheet: Wait T2 (250ms min) after DISP High before turning on Backlight
  HAL_GPIO_WritePin(GPIOA, LCD_BAK_Pin, GPIO_PIN_RESET);	//LCD Backlight off

  packet_init();
  HAL_Delay(1000);

  setvbuf(stdout, NULL, _IONBF, 0); // No buffering

  HAL_StatusTypeDef st = HAL_UART_Receive_IT(&huart2, &rx2_data, 1);
  if(st != HAL_OK) {
    uart2_puts("\r\nUSART2 Receive_IT failed\r\n");
  }

  printf("\r\n\r\n App Start 2025. 12. 10b \r\n");
  uart2_puts("\r\n\r\n [Debug] App Start 2025. 12. 10b \r\n");

//  HAL_UART_Receive_IT(&huart1, (uint8_t*) &rx1_data, 1);
//  HAL_UART_Receive_IT(&huart2, (uint8_t*) &rx2_data, 1);
  HAL_Delay(100);

  // -----------------------------------------------------------------------------
  // power on, eeprom 에서 데이터를 읽어옴.
  // g_oper_mode =  0; //트리거모드
  // g_oper_mode =  1; //시퀀스모드
  // default_value_init(); //기본 값
  // eeprom_save_sys();

//  eeprom_save_facotry();

  eeprom_load_sys();					// load sys data from eeprom
  load_user_param(g_user_default);		// load trig_mode param from eeprom
  eeprom_load_page_all();				// load sequence mode param from eeprom

