alrenyang/stm32h743zit6_TRI/Core/Src/main.c
  uint32_t refresh_count = SDRAM_RefreshCount_IS42S16400J(sdclk_hz);
  refresh_count = (refresh_count * 130) / 100;

  printf("FMC=%lu Hz, SDCLK=%lu Hz, refresh=%lu\r\n", (unsigned long)fmc_hz, (unsigned long)sdclk_hz, (unsigned long)refresh_count);

  HAL_SDRAM_ProgramRefreshRate(&hsdram1, refresh_count);

  if (HAL_SDRAM_ProgramRefreshRate(&hsdram1, refresh_count) != HAL_OK)
  {
	  printf("[  ] sdram step 5 fail\n");
	  Error_Handler();
  }
  /* USER CODE END FMC_Init 2 */
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, F_DATA0_Pin|F_DATA1_Pin|F_DATA2_Pin|F_DATA3_Pin
                          |F_DATA4_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, F_DATA5_Pin|F_DATA6_Pin|F_DATA7_Pin|GPIO_PIN_8
                          |GPIO_PIN_12, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOF, F_DATA8_Pin|F_DATA9_Pin|F_DATA10_Pin|F_DATA11_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LCD_BAK_GPIO_Port, LCD_BAK_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, F_DATA12_Pin|F_DATA13_Pin|F_DATA14_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(F_DATA15_GPIO_Port, F_DATA15_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOG, F_CS_Pin|F_WR_Pin|F_RD_Pin|F_ALE_Pin
                          |HEART_BEAT_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : F_DATA0_Pin F_DATA1_Pin F_DATA2_Pin F_DATA3_Pin
                           F_DATA4_Pin */
  GPIO_InitStruct.Pin = F_DATA0_Pin|F_DATA1_Pin|F_DATA2_Pin|F_DATA3_Pin
                          |F_DATA4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : F_DATA5_Pin F_DATA6_Pin F_DATA7_Pin PC8
                           PC12 */
  GPIO_InitStruct.Pin = F_DATA5_Pin|F_DATA6_Pin|F_DATA7_Pin|GPIO_PIN_8
                          |GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : F_DATA8_Pin F_DATA9_Pin F_DATA10_Pin F_DATA11_Pin */
  GPIO_InitStruct.Pin = F_DATA8_Pin|F_DATA9_Pin|F_DATA10_Pin|F_DATA11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_BAK_Pin */
  GPIO_InitStruct.Pin = LCD_BAK_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BAK_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : KEY_DATA3_Pin KEY_DATA4_Pin EN_A_Pin EN_B_Pin */
  GPIO_InitStruct.Pin = KEY_DATA3_Pin|KEY_DATA4_Pin|EN_A_Pin|EN_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : F_DATA12_Pin F_DATA13_Pin F_DATA14_Pin */
  GPIO_InitStruct.Pin = F_DATA12_Pin|F_DATA13_Pin|F_DATA14_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : F_DATA15_Pin */
  GPIO_InitStruct.Pin = F_DATA15_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(F_DATA15_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : F_CS_Pin F_WR_Pin F_RD_Pin F_ALE_Pin
                           HEART_BEAT_Pin */
  GPIO_InitStruct.Pin = F_CS_Pin|F_WR_Pin|F_RD_Pin|F_ALE_Pin
                          |HEART_BEAT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : KEY_DATA0_Pin KEY_DATA1_Pin KEY_DATA2_Pin */
  GPIO_InitStruct.Pin = KEY_DATA0_Pin|KEY_DATA1_Pin|KEY_DATA2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : LOCK_KEY_Pin LOCAL_KEY_Pin REMOTE_KEY_Pin */
  GPIO_InitStruct.Pin = LOCK_KEY_Pin|LOCAL_KEY_Pin|REMOTE_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*AnalogSwitch Config */
  HAL_SYSCFG_AnalogSwitchConfig(SYSCFG_SWITCH_PA0, SYSCFG_SWITCH_PA0_CLOSE);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        uint32_t error_code = HAL_UART_GetError(huart);
        printf("UART2 Error: 0x%lX\r\n", error_code);
        
        // Clear the error flags
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF | UART_CLEAR_NEF | UART_CLEAR_FEF);

        // Restart the reception
        HAL_UART_Receive_IT(&huart2, &rx2_data, 1);
    }
}

void HAL_UART_AbortCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance == USART2)
	{
		printf("UART2 Abort Complete\r\n");
	}
}
/* USER CODE END 4 */

